title: Credential dumping from memory.
id: 63b4264d-0123-42a4-bafb-1bfda6ccf804
status: experimental
description: Detects a suspicious process attempting to access an LSASS-related process, which could be indicate to credential dumping.
references:
        - https://lolbas-project.github.io/#lsass
        - https://attack.mitre.org/techniques/T1003/001/
        - https://www.ired.team/offensive-security/credential-access-and-credential-dumping/dump-credentials-from-lsass-process-without-mimikatz
author: Phatcharadol Thangplub
date: 2025-08-19
modified: 2025-08-19
tags:
        - attack.T1003.001
logsource:
        product: windows
        service: sysmon
detection:
        selection:
                SourceType|contains: "Microsoft-Windows-Sysmon/Operational"
                EventID: 10
        filter_suspicious_process:
                SourceImage|endswith:
                        - "mimikatz.exe"
                        - "rdrleakdiag.exe"
                        - "createdump.exe"
                        - "dump64.exe"
                        - "DumpMinitool.exe"
                        - "processdump.exe"
                        - "SqlDumper.exe"
                        - "procdump.exe"
        filter_call_trace_rundll32:
                SourceImage|endswith:
                        - "rundll32.exe"
                CallTrace|contains:
                        - "comsvcs.dll"
        filter_lsass_related_process:
                TargetImage|endswith:
                        - "lsass.exe"
                        - "winlogon.exe"
        condition: selection and (
                        (filter_suspicious_process and filter_lsass_related_process) or 
                        (filter_call_trace_rundll32 and filter_lsass_related_process))
falsepositives:
        - Unknown
level: high
